app/views/devise/registrations/edit.html.erb

SELECT "tags".* FROM "tags" ORDER BY "tags"."name" ASC
---
            <%= f.label(:tags) %>
            <%= f.collection_select(
              :tag_ids,
              Tag.order(name: :asc),
              :id,
              :humanized_name,
              {},
              {multiple: :true, class: 'chosen-select'}
            ) %>