app/views/users/show.html.erb

                        <% if message.body %>
                            <% user = User.find(message.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]