app/views/users/show.html.erb

                    <p class="bold">Projects</p>
                    <p><%= @user&.projects.count %></p>
---
SELECT COUNT(*) FROM "projects" INNER JOIN "teams" ON "projects"."id" = "teams"."project_id" WHERE "teams"."user_id" = $1  [["user_id", 6]]

                    <h6>Tags</h6>
                    <% @user.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."user_id" = $1  [["user_id", 6]]

                        <% if message.body %>
                            <% user = User.find(message.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

                        <% if message.body %>
                            <% user = User.find(message.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]