app/views/projects/_form.html.erb

          <%= form.label :user_ids, "Users" %>
          <%= form.collection_select(
            :user_ids,
            User.order(name: :asc),
            :id,
            :name,
            {},
            {multiple: true, class: 'chosen-select'}
          ) %>
---
SELECT "users".* FROM "users" ORDER BY "users"."name" ASC