app/views/projects/index.html.erb

SELECT "projects".* FROM "projects" WHERE (title LIKE '%mini%' OR description LIKE '%mini%')
---
          <p class="bold">Projects</p>
          <p><%= current_user.projects.count %></p>