app/views/projects/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "teams" ON "users"."id" = "teams"."user_id" WHERE "teams"."project_id" = $1  [["project_id", 39]]
---
    <div class="team-show">
      <% @project.users.each do |member| %>