app/views/shoutouts/index.html.erb

        <% if shoutout.author_id == current_user.id  %>
            <% receiver = User.find(shoutout.receiver_id)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]