app/controllers/projects_controller.rb

  def index
    search = params[:query].present? ? params[:query] : nil
    @projects = if search
      Project.where("title LIKE ? OR description LIKE ?", "%#{search}%", "%#{search}%")
    else
      @projects = Project.order(created_at: :desc)
---
SELECT "projects".* FROM "projects" WHERE (title LIKE '%mini%' OR description LIKE '%mini%')
SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC

  def show
    find_project
    @users = User.all
    @team = Team.where(project_id: :id)

    @create_message = CreateMessage.new

    @note = Note.new
    @notes = @project.notes.order(:position)
---
SELECT "notes".* FROM "notes" WHERE "notes"."project_id" = $1 ORDER BY "notes"."position" ASC  [["project_id", 39]]

  def find_project
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]