app/controllers/shoutouts_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
    def index
        @shoutouts = Shoutout.order(created_at: :desc)
        @users = User.all