app/controllers/users_controller.rb

    def show
        find_user
        @users = User.all
        @projects = Project.all
        @team = Team.where(project_id: :id)

        @create_messages = CreateMessage.where(is_public: true)
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC
SELECT "create_messages".* FROM "create_messages" WHERE "create_messages"."is_public" = $1  [["is_public", true]]